# Introduction to Data Science - Lab - Using SQL with Pandas

#### <span style="color:red">Name: Holden Davis</span>

## Introduction

The purpose of this project is to explore using SQL as the language to interact with Pandas dataframes.  

<span style="color:blue">While it is certainly possible to perform all the tasks in this notebook directly using Pandas functions, the point of this exercise is to use SQL.  This means this project will be graded on your use of SQL, so you should use SQL!  ðŸ˜€</span>

Hint: You need to install the Panda SQL module to complete this lab.  See lecture notebook for more information.

For this exercise, we will use data about colleges from the file:

- College.csv

## Import the modules you need here.

In [47]:
import pandas as pd
from pandasql import sqldf

---
## <span style="color:red">Task 1</span>

Create a convenience lambda function to use with `pandasql` that passes global variables to your query object.

In [48]:
#Create a convenience lambda function to use with `pandasql` that passes global variables to your query object. 
queryer = lambda query: sqldf(query, globals())

## Data Aquisition

---
## <span style="color:red">Task 2</span>

**Read the data file into a dataframe called "college".**

In [49]:
#Read the data file into a dataframe called "college".
college = pd.read_csv('College.csv')

---
## <span style="color:red">Task 3</span>

**Display the summary information (i.e., `info`) about the "college" dataframe, including the names of the columns.**

In [50]:
#Display the summary information (i.e., `info`) about the "college" dataframe, including the names of the columns.
college.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 777 entries, 0 to 776
Data columns (total 19 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   School       777 non-null    object
 1   Private      777 non-null    object
 2   Apps         777 non-null    int64
 3   Accept       777 non-null    int64
 4   Enroll       777 non-null    int64
 5   Top10perc    777 non-null    int64
 6   Top25perc    777 non-null    int64
 7   F.Undergrad  777 non-null    int64
 8   P.Undergrad  777 non-null    int64
 9   Outstate     777 non-null    int64
 10  Room.Board   777 non-null    int64
 11  Books        777 non-null    int64
 12  Personal     777 non-null    int64
 13  PhD          777 non-null    int64
 14  Terminal     777 non-null    int64
 15  S.F.Ratio    777 non-null    float64
 16  perc.alumni  777 non-null    int64
 17  Expend       777 non-null    int64
 18  Grad.Rate    777 non-null    int64
dtypes: float64(1), int64(16), object(2)
memory usage: 115.5+ KB

---
## <span style="color:red">Task 4</span>

**Pandas SQL does not recognize column names with embedded periods.**

**Rename the columns to replace '.' with '_' as needed, then display the summary of the dataframe again.**

Check your work by running info again.

<span style="color:blue">Hint:</span> Do a little web searching for how to rename **columns** in Pandas

In [51]:
#Rename the columns to replace '.' with '_' as needed, then display the summary of the dataframe again.
college.columns = [column.replace('.', '_') for column in college.columns]
college.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 777 entries, 0 to 776
Data columns (total 19 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   School       777 non-null    object
 1   Private      777 non-null    object
 2   Apps         777 non-null    int64
 3   Accept       777 non-null    int64
 4   Enroll       777 non-null    int64
 5   Top10perc    777 non-null    int64
 6   Top25perc    777 non-null    int64
 7   F_Undergrad  777 non-null    int64
 8   P_Undergrad  777 non-null    int64
 9   Outstate     777 non-null    int64
 10  Room_Board   777 non-null    int64
 11  Books        777 non-null    int64
 12  Personal     777 non-null    int64
 13  PhD          777 non-null    int64
 14  Terminal     777 non-null    int64
 15  S_F_Ratio    777 non-null    float64
 16  perc_alumni  777 non-null    int64
 17  Expend       777 non-null    int64
 18  Grad_Rate    777 non-null    int64
dtypes: float64(1), int64(16), object(2)
memory usage: 115.5+ KB

---
## <span style="color:red">Task 5</span>

**Using SQL, select just the following columns from the base dataframe and display the result.:**

- school name
- private or public status
- number of students accepted
- number that enrolled

In [52]:
queryer("SELECT School, Private, Accept, Enroll FROM college;")

                             School Private  Accept  Enroll
0      Abilene Christian University     Yes    1232     721
1                Adelphi University     Yes    1924     512
2                    Adrian College     Yes    1097     336
3               Agnes Scott College     Yes     349     137
4         Alaska Pacific University     Yes     146      55
..                              ...     ...     ...     ...
772         Worcester State College      No    1515     543
773               Xavier University     Yes    1805     695
774  Xavier University of Louisiana     Yes    1915     695
775                 Yale University     Yes    2453    1317
776    York College of Pennsylvania     Yes    1855     691

[777 rows x 4 columns]

---
## <span style="color:red">Task 6</span>

**Using SQL, select just the following columns from the base dataframe for only the private colleges and display the result.**

- school name
- private or public status
- number of students accepted
- number that enrolled

In [53]:
queryer("SELECT School, Private, Accept, Enroll FROM college WHERE Private='Yes';")

                              School Private  Accept  Enroll
0       Abilene Christian University     Yes    1232     721
1                 Adelphi University     Yes    1924     512
2                     Adrian College     Yes    1097     336
3                Agnes Scott College     Yes     349     137
4          Alaska Pacific University     Yes     146      55
..                               ...     ...     ...     ...
560  Worcester Polytechnic Institute     Yes    2314     682
561                Xavier University     Yes    1805     695
562   Xavier University of Louisiana     Yes    1915     695
563                  Yale University     Yes    2453    1317
564     York College of Pennsylvania     Yes    1855     691

[565 rows x 4 columns]

---
## <span style="color:red">Task 7</span>

**Using SQL, select just the following columns from the base dataframe for all the colleges with graduation rates of 90% or above.**

**Display the result in descending order by graduation rate (i.e., highest first).**

- school name
- private or public status
- number that enrolled
- graduation rate

In [54]:
queryer("SELECT School, Private, Enroll, Grad_Rate FROM college WHERE Grad_Rate >= 90 ORDER BY Grad_Rate DESC;")

                           School Private  Enroll  Grad_Rate
0               Cazenovia College     Yes     527        118
1                 Amherst College     Yes     418        100
2     College of Mount St. Joseph     Yes     238        100
3              Grove City College     Yes     573        100
4              Harvard University     Yes    1606        100
..                            ...     ...     ...        ...
69          University of Chicago     Yes     922         90
70                 Vassar College     Yes     653         90
71  Washington and Lee University     Yes     425         90
72          Washington University     Yes    1254         90
73                 Webber College     Yes      79         90

[74 rows x 4 columns]

---
## <span style="color:red">Task 8</span>

**Using SQL, select just the following columns from the base dataframe for all the colleges with graduation rates oveof 90% or above and the college is public.**

**Display the result in descending order by graduation rate (i.e., highest first).**

- school name
- private or public status
- number that enrolled
- graduation rate

In [55]:
queryer("SELECT School, Private, Enroll, Grad_Rate FROM college WHERE Grad_Rate >= 90 AND Private='No' ORDER BY Grad_Rate DESC;")

                            School Private  Enroll  Grad_Rate
0  Missouri Southern State College      No     913        100
1         James Madison University      No    2082         98
2           University of Virginia      No    2678         95
3      College of William and Mary      No    1217         93

---
## <span style="color:red">Task 9</span>

**Using SQL, select all the colleges with "Arkansas" as part of their name and display the columns below.**

- school name
- private or public status
- number that enrolled
- graduation rate

Hint: You will need to use LIKE in your SQL statement.

In [56]:
queryer("SELECT School, Private, Enroll, Grad_Rate FROM college WHERE School LIKE '%Arkansas%';")

                                   School Private  Enroll  Grad_Rate
0         Arkansas College (Lyon College)     Yes     166         54
1                Arkansas Tech University      No     951         48
2  University of Arkansas at Fayetteville      No    2133         39

---
## <span style="color:red">Task 10</span>

**Using SQL, select count the number of colleges with graduate rates of 25% or lower.**

In [57]:
queryer("SELECT COUNT(*) AS NUM_TOUGH_SCHOOLS FROM college WHERE Grad_Rate <= 25;")

   NUM_TOUGH_SCHOOLS
0                 10

---
## <span style="color:red">Task 11</span>

**Using SQL, find the lowest and highest graduation rate achieved.  Store that values in variables called 'min_grad_rate'and 'max_grad_rate', respectively. Hint: the result is returned in a Panda DataFrame, so you can use loc to retreive the values.**

In [58]:
maxgradframe = queryer("SELECT MAX(Grad_Rate) FROM college;")
maxgradrate = maxgradframe['MAX(Grad_Rate)'][0]
print("Highest graduation rate:", maxgradrate)
mingradframe = queryer("SELECT MIN(Grad_Rate) FROM college;")
mingradrate = mingradframe['MIN(Grad_Rate)'][0]
print("Lowest graduation rate:", mingradrate)

Highest graduation rate: 118
Lowest graduation rate: 10

---
## <span style="color:red">Task 12</span>

**Using SQL, select the colleges which have the highest graduation rates (i.e., the maximum graduation rates in the data).**

**Display the following columns for all schools with the highest rate.  Use the variables set above to help form this query.**

- school name
- private or public status
- number that enrolled
- graduation rate
- maximum graduation rate

Hint: You obtained the maximum graduation rate in the previous task.

In [59]:
queryer("SELECT School, Private, Enroll, Grad_Rate, '"+str(maxgradrate)+"' AS Max_Grad_Rate FROM college WHERE Grad_Rate= "+ str(maxgradrate) +";")

              School Private  Enroll  Grad_Rate Max_Grad_Rate
0  Cazenovia College     Yes     527        118           118

---
## <span style="color:red">Task 13</span>

**Using SQL, select the colleges which have the lowest graduation rates (i.e., the minimum graduation rates in the data).**

**Display the following columns for all schools with the lowest rate.  Use the variables set above to help form this query.**

- school name
- private or public status
- number that enrolled
- graduation rate

Hint: You already obtained the minimum graduation rate.

In [60]:
queryer("SELECT School, Private, Enroll, Grad_Rate, '"+str(mingradrate)+"' AS Min_Grad_Rate FROM college WHERE Grad_Rate= "+ str(mingradrate) +";")

                      School Private  Enroll  Grad_Rate Min_Grad_Rate
0  Texas Southern University      No    2604         10            10

---
## <span style="color:red">Task 14</span>

**Using SQL, display the average graduation rate, the average number enrolled, and the average student-teacher ratio for private schools vs public schools.**

**Display the following columns for the result.**

- private or public status
- average number that enrolled
- average graduation rate
- average student faculty ratio

Hint: You will need to use GROUPBY in your SQL statement.

In [61]:
queryer("SELECT Private, AVG(Enroll), AVG(Grad_Rate), AVG(S_F_Ratio) FROM college GROUP BY Private;")

  Private  AVG(Enroll)  AVG(Grad_Rate)  AVG(S_F_Ratio)
0      No  1640.872642       56.042453       17.139151
1     Yes   456.945133       68.998230       12.945487

---
## <span style="color:red">Task 15</span>

**Using SQL, display the average graduation rate, the average number enrolled, and the average student-teacher ratio for private schools vs public schools, but including only those schools with graduation rates of 65% or higher.**

**Display the following columns for the result.**

- private or public status
- average number that enrolled
- average graduation rate
- average student faculty ratio

In [62]:
queryer("SELECT Private, AVG(Enroll), AVG(Grad_Rate), AVG(S_F_Ratio) FROM college WHERE Grad_Rate >= 65 GROUP BY Private;")

  Private  AVG(Enroll)  AVG(Grad_Rate)  AVG(S_F_Ratio)
0      No  2386.982456       74.245614       16.368421
1     Yes   529.534286       79.357143       12.470857

<p style="font-size:120%;color:navy;background:linen;padding:10px;text-align:center">&copy; Copyright 2022 by Michelle Talley <br> <br>You may not publish this notebook on any website or share it with anyone without explicit permission of the author. </p>